Revit 2027 API
CableTrayConduitRunBase.Length Property
 The length of the whole (cable tray or conduit) run default 0.0
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Length { get; }
Public ReadOnly Property Length As Double
	Get
public:
property double Length {
	double get ();
}
member Length : float with get
Property Value
Double
See Also
Reference
CableTrayConduitRunBase Class
Autodesk.Revit.DB.Electrical Namespace